experiment_script/graph/Fig-1.FS-GC_VS_Dev-GC/fsgc_old/fio_F2FS_exp_output_f2fs-vanilla_20241226_1523/randwrite/f2fs-vanilla/1/result_4k.txt
test: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.32
Starting 1 process
test: Laying out IO file (1 file / 184320MiB)

test: (groupid=0, jobs=1): err= 0: pid=2575: Thu Dec 26 15:43:24 2024
  write: IOPS=125k, BW=487MiB/s (510MB/s)(570GiB/1200033msec); 0 zone resets
    clat (nsec): min=1187, max=190276k, avg=7673.82, stdev=418555.11
     lat (nsec): min=1245, max=190276k, avg=7732.89, stdev=418555.23
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    4], 20.00th=[    4],
     | 30.00th=[    4], 40.00th=[    4], 50.00th=[    4], 60.00th=[    5],
     | 70.00th=[    5], 80.00th=[    5], 90.00th=[    7], 95.00th=[    8],
     | 99.00th=[   11], 99.50th=[   12], 99.90th=[   16], 99.95th=[   18],
     | 99.99th=[  115]
   bw (  KiB/s): min=130144, max=1119624, per=100.00%, avg=498450.81, stdev=345211.55, samples=2400
   iops        : min=38746, max=279700, avg=124596.98, stdev=82055.30, samples=600
  lat (usec)   : 2=0.01%, 4=55.95%, 10=42.82%, 20=1.19%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=6.65%, sys=60.45%, ctx=663795, majf=1, minf=70
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,149481530,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=487MiB/s (510MB/s), 487MiB/s-487MiB/s (510MB/s-510MB/s), io=570GiB (612GB), run=1200033-1200033msec

Disk stats (read/write):
  nvme2n1: ios=36301348/2644384, merge=4073043/13, ticks=9431402/882713, in_queue=10345561, util=73.85%